VibeCoding-tw/esp32c3-launcher/src/main.cpp
    setMotorPwm(0, 0); 
    
    // 0. 產生唯一的 Hostname
    generateHostname();
    
    // 1. 啟動 BLE
    setupBleServer_Bluedroid();

    // 2. 嘗試連線 Wi-Fi
    connectToSavedWiFi();
}

// --- Loop ---
void loop() {    
    // 1. 超時安全停止檢查 (使用 Timeout 參數)
    if (targetSpeedT != 0 || targetSpeedS != 0) {
        if (millis() - lastControlTime > motorConfig.controlTimeoutMs) {
            Serial.println("🚨 控制超時! 強制設定目標速度為零。");
            targetSpeedT = 0;
            targetSpeedS = 0;
            
            if (pControlCharacteristic) {
                pControlCharacteristic->setValue("TIMEOUT:0,0");
                pControlCharacteristic->notify(); 
            }
        }
    }
    // 2. 處理延遲的廣告重啟請求
    if (should_restart_advertising) {
        Serial.print("Loop: Executing delayed advertising restart... ");
        pServer->startAdvertising(); 
        Serial.println("✅ SUCCESS");
        should_restart_advertising = false;
    }

    // 3. 檢查連線狀態，並啟動後續服務 (只執行一次)
    if (WiFi.status() == WL_CONNECTED && !servicesStarted) {
        Serial.println("✅ Wi-Fi 連線成功，啟動服務...");
        setupMdnsOtaSta();
        setupWebServer();
        servicesStarted = true;
        Serial.println("-------------------------------------------------------");
        Serial.printf("裝置已啟動: %s.local\n", globalHostname.c_str()); 
        Serial.println("-------------------------------------------------------");
    }

    // 4. Web Server 和 OTA 僅在服務啟動後才處理
    if (servicesStarted) {
        server.handleClient();
        ArduinoOTA.handle();
    }
    
    // 5. 處理 BLE 接收到的 Wi-Fi 配置並重啟
    handleBleConfigLoop();
    
    // 6. 馬達 Ramping 邏輯
    motorRampTask();
    
    // 保持 loop() 有機會切換任務
    delay(1); 
}
